[
    {
        "name": "Escape",
        "img": "/Portfolio/RecentWorks/Reach-for-Hope.jpg",
        "desc": "When I was younger, the stories about catcalling felt unreal to me; I wondered: “How are these women finding such weird men”. Then, on the way back to the school after a short visit to the plaza; some guy whistled at us, a group of three girls, from his car. It was around 8 PM and the sky was dark; he stared right at us. After a long pause, we ignored it and never talked about it again. It was bizarre and made me think about the other people on the internet and their experiences; how they probably experienced worse in a more dangerous neighborhood. That’s why I was motivated to draw this Charcoal piece. The phone booth is a metaphor for my comfort zone and the girl stuck in the phone booth is me; I’m safe and protected by its metal walls, but I’m still looking for a way to leave. "
    },
    {
        "name": "Reach for Hope",
        "img": "/Portfolio/RecentWorks/Escape.jpg",
        "desc": "Climate change is a global issue. I realized this in fall of my sophomore year, attending one of artist-activist Monica Johan Bose’s workshops and listening to her passionately speak on the effect of cyclones in Bangladesh. The destroyed grain supply and infrastructure impact more than just Bangladesh; it can potentially lead to a global food crisis. I realize in the face of this climate crisis I am a small part, but this inspired me to attend more of Bose’s workshops and live a more environmentally conscious life. By composting food and reducing plastic bag usage I create my own change; beyond the tragic effects shown in the artwork, I see majestic blue whales: a symbol of our future. "
    },
    {
        "name": "Smashing the Spinal Cord",
        "img": "/Portfolio/RecentWorks/STSC.jpg",
        "desc": "As an artist, I’m deeply concerned about the impact AI will have on the arts — from visual media to music and now writing, a future where human creativity is replaced by machine learning is becoming increasingly possible. In my acrylic piece, “Smashing the Spinal Cord,” I wanted to explore this conflict visually. The female guitarist is ecstatic; her joy is palpable from her facial expression. In contrast, the miniature band on the neck of her guitar is in total disarray. They are not only destroying their equipment but putting her performance at risk—the strings on her guitar have begun to snap—and demonstrating their clear potential to silence this artist amid her performance. "
    },
    {
        "name": "Time's Grasp",
        "img": "/Portfolio/RecentWorks/Times-Grasps.jpg",
        "desc": "In Latin, we learned about the Fates, three older women who determined human destinies. I find myself thinking of these Fates anytime when I begin to feel the pressure of time—at my school, it’s not uncommon to feel any time spent sleeping rather than working is time wasted. In this piece, I represented myself as an older woman at the mercy of the three hands of the Fates, unable to avoid the slings and arrows of time. "
    },
    {
        "name": "My Art Classroom",
        "img": "/Portfolio/RecentWorks/Observ.jpg",
        "desc": ""
    }
]